&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Выбранный цвет подставляется в хранилище значения
	ТекущийОбъект.Цвет = Новый ХранилищеЗначения(ЭтотОбъект.Цвет);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Из хранилища значения цвет подставляется в одноименный реквизит формы
	ЭтотОбъект.Цвет = ТекущийОбъект.Цвет.Получить();
КонецПроцедуры    

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзменениеЦветаКатегории");
КонецПроцедуры
