#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	
	ОтпускаСотрудниковПриИзмененииНаСервере();
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ЗаполнитьСотрудниками(Команда) 
	
	Если Объект.ОтпускаСотрудников.Количество() <> 0  Тогда
		
		Результат = Ждать ВопросАсинх("Список сотрудников будет очищен. Продолжить?", РежимДиалогаВопрос.ДаНет,,,"Вопрос.");	
		
		Если Результат = Неопределено Или Результат = КодВозвратаДиалога.Нет Тогда				
			Возврат;			
		КонецЕсли; 
		
	КонецЕсли;
	
	Объект.ОтпускаСотрудников.Очистить();
	ЗаполнитьСотрудникамиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	ПараметрыФормы = Новый Структура;	
	ПараметрыФормы.Вставить("Адрес", ПоместитьДанныеВоВременноеХранилище()); 
	
	ОткрытьФорму("Документ.BKM_ГрафикОтпусков.Форма.ФормаАнализГрафика", ПараметрыФормы, ЭтотОбъект);   	
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтпускаСотрудниковПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписокОтпусков.Сотрудник КАК Сотрудник,
		|	СписокОтпусков.НомерСтроки КАК НомерСтроки,
		|	РАЗНОСТЬДАТ(СписокОтпусков.ДатаНачала, СписокОтпусков.ДатаОкончания, ДЕНЬ) + 1 КАК ВсегоДней
		|ПОМЕСТИТЬ ВТ_СписоОтпусков
		|ИЗ
		|	&СписокОтпусков КАК СписокОтпусков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СписоОтпусков.Сотрудник КАК Сотрудник,
		|	СУММА(ВТ_СписоОтпусков.ВсегоДней) КАК ВсегоДней
		|ПОМЕСТИТЬ ВТ_СписокСгруппированный
		|ИЗ
		|	ВТ_СписоОтпусков КАК ВТ_СписоОтпусков
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СписоОтпусков.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СписоОтпусков.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(ВТ_СписокСгруппированный.ВсегоДней, 0) КАК ВсегоДней
		|ИЗ
		|	ВТ_СписоОтпусков КАК ВТ_СписоОтпусков
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СписокСгруппированный КАК ВТ_СписокСгруппированный
		|		ПО ВТ_СписоОтпусков.Сотрудник = ВТ_СписокСгруппированный.Сотрудник";
	
	
	СписокОтпусков = Объект.ОтпускаСотрудников.Выгрузить(,"Сотрудник,НомерСтроки,ДатаНачала,ДатаОкончания" );
	Запрос.УстановитьПараметр("СписокОтпусков",СписокОтпусков);
	
	ТаблицаОтпусков = Запрос.Выполнить().Выбрать();   
	
		
	Пока ТаблицаОтпусков.Следующий() Цикл
		
		Объект.ОтпускаСотрудников[ТаблицаОтпусков.НомерСтроки - 1].ВсегоДней = ТаблицаОтпусков.ВсегоДней;
		
	КонецЦикла;
	
	
КонецПроцедуры


&НаСервере                                       
Функция ПоместитьДанныеВоВременноеХранилище() 
	
	Возврат ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить(), УникальныйИдентификатор);  
	
КонецФункции 

&НаСервере
Процедура ЗаполнитьСотрудникамиНаСервере() 
	
	Запрос = Новый Запрос;
	Запрос.Текст =    
	"ВЫБРАТЬ
	|	ВКМ_Сотрудники.Ссылка КАК Сотрудник
	|ИЗ
	|	Справочник.ВКМ_Сотрудники КАК ВКМ_Сотрудники
	|ГДЕ
	|	НЕ ВКМ_Сотрудники.ПометкаУдаления";
	
	СписокСотрудников = Запрос.Выполнить().Выгрузить();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(СписокСотрудников,Объект.ОтпускаСотрудников);
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьСотрудникамиНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении1(Элемент)
	ОтпускаСотрудниковПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ГрафикОтпусков(Команда) 
	
	ПараметрыФормы = Новый Структура;	
	ПараметрыФормы.Вставить("Адрес", ПоместитьДанныеВоВременноеХранилище()); 
	
	ОткрытьФорму("Документ.BKM_ГрафикОтпусков.Форма.ФормаАнализГрафика", ПараметрыФормы, ЭтотОбъект); 

КонецПроцедуры


#КонецОбласти


