
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

//Начало доработки Кальянов

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла; 
	
	 Для Каждого ТекСтрока Из Услуги Цикл
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Клиент = Контрагент;
		Движение.Договор = Договор;
		Движение.СуммаКОплате = ТекСтрока.Сумма;
		Движение.КоличествоЧасов = ТекСтрока.Количество; 
	КонецЦикла;
	

КонецПроцедуры

Процедура ВыполнитьАвтозаполнение() Экспорт
    
    НоменклатураАП = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
    НоменклатураРС = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
    
    Если НЕ ЗначениеЗаполнено(НоменклатураАП) ИЛИ НЕ ЗначениеЗаполнено(НоменклатураРС) Тогда
        ТекстОшибки = "Не заполнены константы номенклатуры для автозаполнения. Обратитесь к администратору.";
        ВызватьИсключение ТекстОшибки;
    КонецЕсли;
    
    Услуги.Очистить();
    
    Если НЕ ЗначениеЗаполнено(Договор) Тогда
        Возврат;
    КонецЕсли;
    
    РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ВКМ_АбонентскаяПлата");
    СуммаАП = РеквизитыДоговора.ВКМ_АбонентскаяПлата;
    
    Если СуммаАП > 0 Тогда
        НоваяСтрока = Услуги.Добавить();
        НоваяСтрока.Номенклатура = НоменклатураАП;
        НоваяСтрока.Количество = 1;
        НоваяСтрока.Цена = СуммаАП;
        НоваяСтрока.Сумма = СуммаАП;
    КонецЕсли;
    
    ДанныеРабот = ПолучитьДанныеВыполненныхРабот();
    
    Если ДанныеРабот.Количество > 0 Тогда
        НоваяСтрока = Услуги.Добавить();
        НоваяСтрока.Номенклатура = НоменклатураРС;
        НоваяСтрока.Количество = ДанныеРабот.Количество;
        НоваяСтрока.Цена = ?(ДанныеРабот.Количество > 0, ДанныеРабот.Сумма / ДанныеРабот.Количество, 0);
        НоваяСтрока.Сумма = ДанныеРабот.Сумма;
	КонецЕсли;     
	
	СуммаДокумента = Услуги.Итог("Сумма") + Товары.Итог("Сумма");
	
	Основание = ПолучитьОснование(Договор);
КонецПроцедуры

Функция ПолучитьДанныеВыполненныхРабот()
    
    НачалоМесяца = НачалоМесяца(Дата);
	КонецМесяца = КонецМесяца(Дата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботы.КоличествоЧасов, 0) КАК Количество,
	|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботы.СуммаКОплате, 0) КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
	|ГДЕ
	|	ВКМ_ВыполненныеКлиентуРаботы.Договор = &Договор
	|	И ВКМ_ВыполненныеКлиентуРаботы.Период МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца);
	Запрос.УстановитьПараметр("Договор", Договор);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ДанныеРабот = Новый Структура("Количество, Сумма", 0, 0);
	
	Если Выборка.Следующий() Тогда
		ДанныеРабот.Количество = Выборка.Количество;
		ДанныеРабот.Сумма = Выборка.Сумма;
	КонецЕсли;
    
    Возврат ДанныеРабот;
    
КонецФункции    

Функция ПолучитьОснование(Договор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|   ЗаказПокупателя.Ссылка КАК Ссылка
	|ИЗ
	|   Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|   ЗаказПокупателя.Договор = &Договор
	|УПОРЯДОЧИТЬ ПО
	|   ЗаказПокупателя.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции;


//КонецДоработки Кальянов

#КонецОбласти

#КонецЕсли
