		
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
			
#Область ОбработчикиСобытий
			
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответсвенный = Пользователи.АвторизованныйПользователь(); 
КонецПроцедуры
 

Процедура ОбработкаПроведения(Отказ, Режим)  
	
	Если ОсновныеНачислния.Количество() = 0 И ДополнительныеНачисления.Количество() = 0 Тогда
		ТекстСообщения = "Обе табличные части документа пусты. Документ не проведен.";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Возврат;	
	КонецЕсли;
	
	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;  
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.BKM_Удержания.Записывать = Истина;   
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрРасчета.ВКМ_ОсновныеНачисления");  
	ЭлементБлокировки = Блокировка.Добавить("РегистрРасчета.ВКМ_ДополнительныеНачисления");  
	ЭлементБлокировки = Блокировка.Добавить("РегистрРасчета.BKM_Удержания"); 
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы"); 
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ОсновныеНачислния;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сотрудник", "Сотрудник"); 
	Блокировка.Заблокировать();
	
	СформироватьДвиженияПоОсновнымНачислениям();
	СформироватьСторноЗаписи();
	СформироватьДвиженияПоПремииПроцентом();
	СформироватьНДФЛ();
	РасчитатьОклады(); 
	РассчитатьОтпускныеНачисления();
	РасчитатьНДФЛ(); 
	СформироватьВзаиморасчетыССотрудниками(); 
	СформироватьДвиженияВыполненныеСотрудникомРаботы(Отказ);
	
КонецПроцедуры   

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвиженияПоОсновнымНачислениям() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачислния.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_СписокСотрудников
	|ИЗ
	|	Документ.ВКМ_НачислениеЗаработнойПлаты.ОсновныеНачислния КАК ВКМ_НачислениеЗаработнойПлатыОсновныеНачислния
	|ГДЕ
	|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачислния.Ссылка = &Ссылка
	|	И ВКМ_НачислениеЗаработнойПлатыОсновныеНачислния.ВидРасчета = &Оклад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СписокСотрудников.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад, 0) КАК Оклад
	|ПОМЕСТИТЬ ВТ_Оклады
	|ИЗ
	|	ВТ_СписокСотрудников КАК ВТ_СписокСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
	|				&ДатаДокумента,
	|				Сотрудник В
	|					(ВЫБРАТЬ
	|						ВКМ_НачислениеЗаработнойПлатыОсновныеНачислния.Сотрудник КАК Сотрудник
	|					ИЗ
	|						Документ.ВКМ_НачислениеЗаработнойПлаты.ОсновныеНачислния КАК ВКМ_НачислениеЗаработнойПлатыОсновныеНачислния
	|					ГДЕ
	|						ВКМ_НачислениеЗаработнойПлатыОсновныеНачислния.Ссылка = &Ссылка
	|						И ВКМ_НачислениеЗаработнойПлатыОсновныеНачислния.ВидРасчета = &Оклад)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВТ_СписокСотрудников.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачислния.Сотрудник КАК Сотрудник,
	|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачислния.ВидРасчета КАК ВидРасчета,
	|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачислния.ДатаНачала КАК ПериодДействияНачало,
	|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачислния.ДатаОкончания КАК ПериодДействияКонец,
	|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачислния.График КАК График,
	|	ВЫБОР
	|		КОГДА ВКМ_НачислениеЗаработнойПлатыОсновныеНачислния.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск)
	|			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВКМ_НачислениеЗаработнойПлатыОсновныеНачислния.ДатаНачала, МЕСЯЦ, -12), МЕСЯЦ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК БазовыйПериодНачало,
	|	ВЫБОР
	|		КОГДА ВКМ_НачислениеЗаработнойПлатыОсновныеНачислния.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск)
	|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ВКМ_НачислениеЗаработнойПлатыОсновныеНачислния.ДатаНачала, МЕСЯЦ, -1), МЕСЯЦ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК БазовыйПериодКонец,
	|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачислния.Ссылка.Дата КАК ПериодРегистрации,
	|	ЕСТЬNULL(ВТ_Оклады.Оклад, 0) КАК Показатель
	|ИЗ
	|	Документ.ВКМ_НачислениеЗаработнойПлаты.ОсновныеНачислния КАК ВКМ_НачислениеЗаработнойПлатыОсновныеНачислния
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Оклады КАК ВТ_Оклады
	|		ПО ВКМ_НачислениеЗаработнойПлатыОсновныеНачислния.Сотрудник = ВТ_Оклады.Сотрудник
	|ГДЕ
	|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачислния.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		Если Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад 
			И Выборка.Показатель = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить(); 
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		
	КонецЦикла;   
	
	Движения.ВКМ_ОсновныеНачисления.Записать();
	
КонецПроцедуры

Процедура СформироватьСторноЗаписи()
	
	СторноЗаписи = Движения.ВКМ_ОсновныеНачисления.ПолучитьДополнение();
	
	Если Не ЗначениеЗаполнено(СторноЗаписи) Тогда
		Возврат;
	КонецЕсли; 
	
	Для Каждого Запись Из СторноЗаписи Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Запись);
		Движение.Сторно = Истина;
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = Запись.ПериодДействияНачалоСторно;
		Движение.ПериодДействияКонец = Запись.ПериодДействияКонецСторно;
		
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать();
	
КонецПроцедуры

Процедура СформироватьДвиженияПоПремииПроцентом()	
	
	Для Каждого ТекСтрокаДополнительныеНачисления Из ДополнительныеНачисления Цикл
		
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПремияПроцентом;
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрокаДополнительныеНачисления.Сотрудник;
		Движение.Результат = ТекСтрокаДополнительныеНачисления.Сумма;
		Движение.ЧасовКОплате = ТекСтрокаДополнительныеНачисления.ВсегоЧасов;
		
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	
КонецПроцедуры

Процедура СформироватьНДФЛ()
	
	СписокСотрудников = ОсновныеНачислния.Выгрузить(,"Сотрудник"); 
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДополнительныеНачисления.Выгрузить(,"Сотрудник"), СписокСотрудников); 
	СписокСотрудников.Свернуть("Сотрудник"); 
	
	Для Каждого Сотрудник Из СписокСотрудников Цикл
		
		Движение = Движения.BKM_Удержания.Добавить(); 
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ПериодРегистрации = Дата;        
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		Движение.Сотрудник = Сотрудник.Сотрудник;
		
	КонецЦикла;
	
	Движения.BKM_Удержания.Записать();	
	
КонецПроцедуры

Процедура РасчитатьОклады() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия, 0) КАК Норма,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
	|			Регистратор = &Регистратор
	|				И ВидРасчета = &ВидРасчета) КАК ВКМ_ОсновныеНачисленияДанныеГрафика";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
		
		Если Выборка.Норма <> 0 Тогда
			Движение.Результат = Движение.Показатель * Выборка.Факт / Выборка.Норма;
		КонецЕсли;	
		
		Движение.ОтработаноДней = Выборка.Факт;
		
		Если Движение.Сторно Тогда 
			Движение.Результат = -Движение.Результат;
			Движение.ОтработаноДней = -Движение.ОтработаноДней;
		КонецЕсли;
		
	КонецЦикла; 
	
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
	
КонецПроцедуры

Процедура РассчитатьОтпускныеНачисления()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.РезультатБаза, 0) + ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.РезультатБаза, 0) КАК РезультатБаза,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ОтработаноДнейБаза, 0) КАК ОтработаноДнейБаза
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(
	|				&Измерения,
	|				&Измерения,
	|				,
	|				Регистратор = &Регистратор
	|					И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления
	|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ДополнительныеНачисления(
	|				&Измерения,
	|				&Измерения,
	|				,
	|				Регистратор = &Регистратор
	|					И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления
	|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
	|				Регистратор = &Регистратор
	|					И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
	|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки
	|ГДЕ
	|	ВКМ_ОсновныеНачисления.Регистратор = &Регистратор
	|	И ВКМ_ОсновныеНачисления.ВидРасчета = &Отпуск";
	
	Запрос.УстановитьПараметр("Отпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	Измерения = Новый Массив; 
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
		
		Движение.Показатель = Выборка.РезультатБаза;
		
		Если Выборка.ОтработаноДнейБаза <> 0 Тогда
			Движение.Результат = Выборка.РезультатБаза * Выборка.Факт / Выборка.ОтработаноДнейБаза;
		КонецЕсли;		
		Движение.ОтработаноДней = Выборка.Факт;
		
		Если Движение.Сторно Тогда 
			Движение.Результат = -Движение.Результат; 
			Движение.ОтработаноДней = -Выборка.Факт;
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина); 
	
КонецПроцедуры

Процедура РасчитатьНДФЛ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(BKM_УдержанияБазаВКМ_ОсновныеНачисления.РезультатБаза, 0) КАК РезультатБазаОсновныеНачисления,
	|	ЕСТЬNULL(BKM_УдержанияБазаВКМ_ОсновныеНачисления.НомерСтроки, 0) КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_ОсновныеНачисления
	|ИЗ
	|	РегистрРасчета.BKM_Удержания.БазаВКМ_ОсновныеНачисления(
	|			&Измерения,
	|			&Измерения,
	|			&Разрезы,
	|			Регистратор = &Ссылка
	|				И ВидРасчета = &НДФЛ) КАК BKM_УдержанияБазаВКМ_ОсновныеНачисления
	|ГДЕ
	|	BKM_УдержанияБазаВКМ_ОсновныеНачисления.Регистратор = BKM_УдержанияБазаВКМ_ОсновныеНачисления.РегистраторРазрез
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(BKM_УдержанияБазаВКМ_ДополнительныеНачисления.РезультатБаза, 0) КАК РезультатБазаДополнительныеНачисления,
	|	ЕСТЬNULL(BKM_УдержанияБазаВКМ_ДополнительныеНачисления.НомерСтроки, 0) КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_ДополнительныеНачисления
	|ИЗ
	|	РегистрРасчета.BKM_Удержания.БазаВКМ_ДополнительныеНачисления(
	|			&Измерения,
	|			&Измерения,
	|			&Разрезы,
	|			Регистратор = &Ссылка
	|				И ВидРасчета = &НДФЛ) КАК BKM_УдержанияБазаВКМ_ДополнительныеНачисления
	|ГДЕ
	|	BKM_УдержанияБазаВКМ_ДополнительныеНачисления.Регистратор = BKM_УдержанияБазаВКМ_ДополнительныеНачисления.РегистраторРазрез
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ДополнительныеНачисления.РезультатБазаДополнительныеНачисления, 0) + ЕСТЬNULL(ВТ_ОсновныеНачисления.РезультатБазаОсновныеНачисления, 0) КАК БазаНДФЛ,
	|	BKM_Удержания.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	РегистрРасчета.BKM_Удержания КАК BKM_Удержания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновныеНачисления КАК ВТ_ОсновныеНачисления
	|		ПО BKM_Удержания.НомерСтроки = ВТ_ОсновныеНачисления.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДополнительныеНачисления КАК ВТ_ДополнительныеНачисления
	|		ПО BKM_Удержания.НомерСтроки = ВТ_ДополнительныеНачисления.НомерСтроки
	|ГДЕ
	|	BKM_Удержания.Регистратор = &Ссылка
	|	И BKM_Удержания.ВидРасчета = &НДФЛ"; 
	
	Запрос.УстановитьПараметр("НДФЛ", ПланыВидовРасчета.ВКМ_Удержания.НДФЛ);   
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Измерения = Новый Массив; 
	Измерения.Добавить("Сотрудник");                                 
	
	Разрезы = Новый Массив; 
	Разрезы.Добавить("Регистратор");
	
	Запрос.УстановитьПараметр("Разрезы", Разрезы);
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.BKM_Удержания[Выборка.НомерСтроки - 1];
		Движение.Результат = Выборка.БазаНДФЛ * 13 / 100;
		
	КонецЦикла;	
	
	Движения.BKM_Удержания.Записать(, Истина);
	
КонецПроцедуры

Процедура СформироватьВзаиморасчетыССотрудниками()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисления.Результат, 0) КАК Сумма
	|ПОМЕСТИТЬ ВТ_Результаты
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
	|ГДЕ
	|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВКМ_ДополнительныеНачисления.Сотрудник,
	|	ЕСТЬNULL(ВКМ_ДополнительныеНачисления.Результат, 0)
	|ИЗ
	|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	|ГДЕ
	|	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	BKM_Удержания.Сотрудник,
	|	-ЕСТЬNULL(BKM_Удержания.Результат, 0)
	|ИЗ
	|	РегистрРасчета.BKM_Удержания КАК BKM_Удержания
	|ГДЕ
	|	BKM_Удержания.Регистратор = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результаты.Сотрудник КАК Сотрудник,
	|	СУММА(ВТ_Результаты.Сумма) КАК Сумма
	|ИЗ
	|	ВТ_Результаты КАК ВТ_Результаты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Результаты.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Сумма = Выборка.Сумма;
		
	КонецЦикла;
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
КонецПроцедуры 

Процедура СформироватьДвиженияВыполненныеСотрудникомРаботы(Отказ)
	
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записать();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ДополнительныеНачисления;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сотрудник", "Сотрудник");
	
	Попытка
		Блокировка.Заблокировать();	
	Исключение
		ОбщегоНазначения.СообщитьПользователю("Ошибка блокировки данных. Документ не проведен.",,,,Отказ);
		Возврат;
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст =       
	"ВЫБРАТЬ
	|	ВКМ_НачислениеЗаработнойПлатыДополнительныеНачисления.Сотрудник КАК Сотрудник,
	|	СУММА(ВКМ_НачислениеЗаработнойПлатыДополнительныеНачисления.Сумма) КАК Сумма,
	|	СУММА(ВКМ_НачислениеЗаработнойПлатыДополнительныеНачисления.ВсегоЧасов) КАК ВсегоЧасов
	|ПОМЕСТИТЬ ВТ_Сотрудник
	|ИЗ
	|	Документ.ВКМ_НачислениеЗаработнойПлаты.ДополнительныеНачисления КАК ВКМ_НачислениеЗаработнойПлатыДополнительныеНачисления
	|ГДЕ
	|	ВКМ_НачислениеЗаработнойПлатыДополнительныеНачисления.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_НачислениеЗаработнойПлатыДополнительныеНачисления.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сотрудник.Сотрудник КАК Сотрудник,
	|	ВТ_Сотрудник.Сотрудник.Представление КАК СотрудникПредставление,
	|	ВТ_Сотрудник.Сумма КАК ВсегоКОплате,
	|	ВТ_Сотрудник.ВсегоЧасов КАК ВсегоЧасов,
	|	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОстатки.ВсегоЧасовОстаток, 0) КАК ВсегоЧасовОстаток,
	|	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОстатки.ВсегоКОплатеОстаток, 0) КАК ВсегоКОплатеОстаток
	|ИЗ
	|	ВТ_Сотрудник КАК ВТ_Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Остатки(
	|				&МоментВремени,
	|				Сотрудник В
	|					(ВЫБРАТЬ
	|						ВТ_Сотрудник.Сотрудник
	|					ИЗ
	|						ВТ_Сотрудник КАК ВТ_Сотрудник)) КАК ВКМ_ВыполненныеСотрудникомРаботыОстатки
	|		ПО ВТ_Сотрудник.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОстатки.Сотрудник";	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ВсегоКОплате > Выборка.ВсегоКОплатеОстаток Тогда
			
			ТекстСообщения = СтрШаблон("Документ не проведен. Для сотрудника %1 сумма начисления (%2) больше чем сумма за выполненные работы (%3)",
			Выборка.СотрудникПредставление, Выборка.ВсегоКОплате, Выборка.ВсегоКОплатеОстаток);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ); 
			
		КонецЕсли;
		
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.ВсегоКОплате = Выборка.ВсегоКОплате;
		
		Если Выборка.ВсегоКОплате = Выборка.ВсегоКОплатеОстаток Тогда
			Движение.ВсегоЧасов = Выборка.ВсегоЧасовОстаток;
		Иначе				 
			Движение.ВсегоЧасов = Выборка.ВсегоЧасов;
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записать();
		
КонецПроцедуры

#КонецОбласти    
	
#КонецЕсли     
///////////