
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастройкаУсловногоОформленияПодЦветКатегорий();
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	НастройкаУсловногоОформленияПодЦветКатегорий();
КонецПроцедуры

&НаКлиенте
Процедура ВыделятьКатегорииЦветомПриИзменении(Элемент)
	НастройкаУсловногоОформленияПодЦветКатегорий();
КонецПроцедуры

&НаСервере
Процедура НастройкаУсловногоОформленияПодЦветКатегорий()	
	// Очищаем всё условное оформление, которое есть, чтобы не было дублей
	Список.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Очистить();
	Если ВыделятьКатегорииЦветом Тогда
		// Передаем условное оформление фиксированных настроек списка в процедуру общего модуля и там программно настраиваем
		УсловноеОформлениеСписка = Список.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление;
	    ВКМ_ОбщийСерверныйМодуль.НастройкаУсловногоОформленияПодЦветКатегорий(УсловноеОформлениеСписка, "Код", "Код");
	КонецЕсли;
КонецПроцедуры


