	
	#Область ПрограммныйИнтерфейс
	
Функция СоздатьСписокДокументовРеализацииТоваровИУслуг(ДатаНачалаПериода, ДатаОкончанияПериода) Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ДоговорыКонтрагентов.Ссылка КАК Договор,
    |    ДоговорыКонтрагентов.Владелец КАК Владелец,
    |    ДоговорыКонтрагентов.Организация КАК Организация,
    |    ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.Владелец) КАК КонтрагентПредставление,
    |    ПРЕДСТАВЛЕНИЕССЫЛКИ(ДоговорыКонтрагентов.Ссылка) КАК ДоговорПредставление,
    |    ДоговорыКонтрагентов.ВКМ_ДатаНачала КАК ВКМ_ДатаНачала,
    |    ДоговорыКонтрагентов.ВКМ_ДатаОкончания КАК ВКМ_ДатаОкончания
    |ПОМЕСТИТЬ ВТ_Договора
    |ИЗ
    |    Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
    |ГДЕ
    |    ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание)
    |    И НЕ ДоговорыКонтрагентов.ПометкаУдаления
    |    И ДоговорыКонтрагентов.ВКМ_ДатаОкончания >= &ДатаОкончанияПериода
    |    И ДоговорыКонтрагентов.ВКМ_ДатаНачала <= &ДатаНачалаПериода;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |    РеализацияТоваровУслуг.Ссылка КАК ДокументСсылка,
    |    РеализацияТоваровУслуг.Договор КАК Договор
    |ПОМЕСТИТЬ ВТ_Документы
    |ИЗ
    |    Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
    |ГДЕ
    |    РеализацияТоваровУслуг.Проведен
    |    И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачалаПериода И &ДатаОкончанияПериода
    |    И РеализацияТоваровУслуг.Договор В
    |            (ВЫБРАТЬ
    |                ВТ_Договора.Договор КАК Договор
    |            ИЗ
    |                ВТ_Договора КАК ВТ_Договора);
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |    ВТ_Договора.Договор КАК Договор,
    |    ВТ_Договора.Владелец КАК Владелец,
    |    ВТ_Договора.Организация КАК Организация,
    |    ВТ_Договора.КонтрагентПредставление КАК КонтрагентПредставление,
    |    ВТ_Договора.ДоговорПредставление КАК ДоговорПредставление,
    |    ВТ_Договора.ВКМ_ДатаНачала КАК ВКМ_ДатаНачала,
    |    ВТ_Договора.ВКМ_ДатаОкончания КАК ВКМ_ДатаОкончания,
    |    ВТ_Документы.ДокументСсылка КАК ДокументСсылка
    |ИЗ
    |    ВТ_Договора КАК ВТ_Договора
    |        ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Документы КАК ВТ_Документы
    |        ПО ВТ_Договора.Договор = ВТ_Документы.Договор";
    
    Запрос.УстановитьПараметр("ДатаНачалаПериода", ДатаНачалаПериода);
    Запрос.УстановитьПараметр("ДатаОкончанияПериода", ДатаОкончанияПериода);
    
    Выборка = Запрос.Выполнить().Выбрать();
    
    ДокументовСоздано = 0;
    ДокументовНеСоздано = 0; 
    
    СписокДоговоровИРеализаций = Новый ТаблицаЗначений;
    СписокДоговоровИРеализаций.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
    СписокДоговоровИРеализаций.Колонки.Добавить("Реализация", Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));    
    
    Пока Выборка.Следующий() Цикл
        Если ЗначениеЗаполнено(Выборка.ДокументСсылка) Тогда
            Продолжить;
        КонецЕсли;
        
        Попытка
            ДокументРеализации = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
            ДокументРеализации.Дата = ДатаОкончанияПериода; // Устанавливаем дату документа
            ДокументРеализации.Контрагент = Выборка.Владелец;
            ДокументРеализации.Договор = Выборка.Договор;
            ДокументРеализации.Организация = Выборка.Организация; 
			Основание = ДокументРеализации.ПолучитьОснование(Выборка.Договор);
			ДокументРеализации.Основание = Основание; 
			ДокументРеализации.Ответственный = Пользователи.АвторизованныйПользователь();
			ДокументРеализации.Комментарий = "Создано автоматически"; 
				
            ДокументРеализации.ВыполнитьАвтозаполнение();   
			
            Если ДокументРеализации.СуммаДокумента = 0 Тогда
                Продолжить;
            КонецЕсли;
            
            Если ДокументРеализации.ПроверитьЗаполнение() Тогда
                ДокументРеализации.Записать(РежимЗаписиДокумента.Проведение); 
                
                ДокументовСоздано = ДокументовСоздано + 1;
                
                Строка = СписокДоговоровИРеализаций.Добавить();
                Строка.Договор = Выборка.Договор;
                Строка.Реализация = ДокументРеализации.Ссылка;
                
            Иначе 
                ТекстИсключения = СтрШаблон("Обнаружены ошибки при проверке заполнения. Документ Реализации товаров и услуг для контрагента %1 с договором %2 не создан.",Выборка.КонтрагентПредставление, Выборка.ДоговорПредставление);
                ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ТекстИсключения, УровеньЖурналаРегистрации.Ошибка,,, "Документ не создан.");
                ДокументовНеСоздано = ДокументовНеСоздано + 1;
            КонецЕсли;
            
        Исключение  
            ДокументовНеСоздано = ДокументовНеСоздано + 1;
            ЗаписьЖурналаРегистрации("НедопустимаяОперация", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
        КонецПопытки;
    КонецЦикла;
    
    Результат = Новый Структура();
    Результат.Вставить("МассивДоговоровИРеализаций", ОбщегоНазначения.ТаблицаЗначенийВМассив(СписокДоговоровИРеализаций));
    Результат.Вставить("ДокументовСоздано",ДокументовСоздано);
    Результат.Вставить("ДокументовНеСоздано", ДокументовНеСоздано);
    
    Возврат Результат;
    
КонецФункции



#КонецОбласти
	
