
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Начало > Окончание Тогда
		Сообщить("Конец задачи не может быть раньше, чем начало задачи.");
		Отказ = Истина;
	КонецЕсли; 
		
	Дата = НачалоДня(Дата); 
	
	// Заполняем реквизит текущим значением параметра сеанса
	Если Пользователь.Пустая() Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;   
	
КонецПроцедуры  

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ТаблицаПовторов.Очистить();
	ЕстьПовтор = Ложь;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
    // Удаляем помеченные документы
	Если ПометкаУдаления Тогда
		Движения.ЗаписиЗадач.Записать();
		Возврат;
	КонецЕсли;
	
	// регистр ЗаписиЗадач
	Движения.ЗаписиЗадач.Записывать = Истина;
	// Повторый отсуствуют
	Если НЕ ЕстьПовтор Тогда
		Движение = Движения.ЗаписиЗадач.Добавить();
		Движение.Период = Дата;
		Движение.ВремяНачала = Начало;
		Движение.ВремяОкончания = Окончание;
		Движение.Пользователь = Пользователь;
	Иначе
		// ТЧ документа
		Для каждого ТекСтрока Из ТаблицаПовторов Цикл
			Если ТекСтрока.Удаленный Тогда
				// Пропуск строки
				Продолжить;
			КонецЕсли;
			
			Движение = Движения.ЗаписиЗадач.Добавить();	
			// Есть замещения
			Если ЗначениеЗаполнено(ТекСтрока.ДатаЗамещения) Тогда
				Движение.Период = ТекСтрока.ДатаЗамещения;
				Движение.ВремяНачала = ТекСтрока.ВремяНачалаЗамещения;
				Движение.ВремяОкончания = ТекСтрока.ВремяОкончанияЗамещения;
			// Замещений нет	
			Иначе
				Движение.Период = ТекСтрока.ДатаПовтора;
				Движение.ВремяНачала = Начало;
				Движение.ВремяОкончания = Окончание;
			КонецЕсли;
			Движение.Пользователь = Пользователь;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры 