
#Область ЗаполнениеЗарплатнойВедомости
&НаКлиенте
Процедура Заполнить(Команда)  
	
	Если Объект.Выплаты.Количество() <> 0 Тогда
		ВопросПриИзменении();  
	КонецЕсли;
	
	ЗаполнитьНаСервере();  
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВопросПриИзменении() 
	
	Результат = Ждать ВопросАсинх("Табличная часть - Выплаты будет очищена. Продолжить?", 
	РежимДиалогаВопрос.ДаНет,,,"Вопрос.");	
	
	Если Результат = Неопределено Или Результат = КодВозвратаДиалога.Нет Тогда				
		Возврат;			
	КонецЕсли; 
	
	Объект.Выплаты.Очистить();	  
	
КонецПроцедуры   

#КонецОбласти

#Область СерверныеПроцедуры

 &НаСервере
Процедура ЗаполнитьНаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст =   
	"ВЫБРАТЬ
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
	|	СУММА(ЕСТЬNULL(ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток, 0)) КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&МоментВремени, ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
	|ГДЕ
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник";
	
	Запрос.УстановитьПараметр("МоментВремени", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ТекстСообщения = "Нет данных для формирования зарплатной ведомости.";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Объект.Выплаты.Добавить(), Выборка);
	КонецЦикла;
		
КонецПроцедуры     

#КонецОбласти
