#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд для создания на основании.
//
// Параметры:
//  КомандыСоздания - см. СозданиеНаОсновании.КомандыСоздания
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСоздания) Экспорт
	
	// Здесь можно добавить команды создания на основании
	
КонецПроцедуры

// Используется в одноименной процедуре модуля подсистемы ПодключаемыеКоманды
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Пример добавления команды печати
	// КомандаПечати = КомандыПечати.Добавить();
	// КомандаПечати.Идентификатор = "ЛистУчетаРабочегоВремени";
	// КомандаПечати.Представление = НСтр("ru = 'Лист учёта рабочего времени'");
	// КомандаПечати.Порядок = 1;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти