  #Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	  
#Область ОбработчикиСобытий   
Процедура ОбработкаПроведения(Отказ, Режим)
		  
		  ПроверитьДанныеДоговора(Отказ);
		  
		  Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
		  ВсегоЧасовКОплатеКлиенту = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
		  СтавкаЧасаПоДоговору = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор,"ВКМ_СтоимостьЧаса");
		  СуммаКОплатеКлиенту = ВсегоЧасовКОплатеКлиенту * СтавкаЧасаПоДоговору;
		  
		  Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		  Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		  Движение.Период = Дата;
		  Движение.КоличествоЧасов = ВсегоЧасовКОплатеКлиенту;
		  Движение.СуммаКОплате = СуммаКОплатеКлиенту;
		  Движение.Клиент = Клиент;
		  Движение.Договор = Договор;
		  
КонецПроцедуры    

Процедура ПроверитьДанныеДоговора(Отказ)
	
	Если ВыполненныеРаботы.Количество() = 0 Тогда
		ТекстСообщения = "Для проведения документа заполните табличную часть документа";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;  
		Возврат;
	КонецЕсли;   
	
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ВидДоговора, ВКМ_ДатаНачала, ВКМ_ДатаОкончания");
	
	Если РеквизитыДоговора.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда 
		ТекстСообщения = "Для проведения документа должен быть выбран договор с типом ""Абонентская плата""";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Ссылка,"Договор","Объект");
		Отказ = Истина; 
		Возврат;
	Иначе
		Если РеквизитыДоговора.ВКМ_ДатаНачала > Дата Или РеквизитыДоговора.ВКМ_ДатаОкончания < Дата Тогда
			ТекстСообщения = "Дата документа должна находиться в периоде действия договора: " 
                      + РеквизитыДоговора.BKM_ДатаНачала + " - " + РеквизитыДоговора.BKM_ДатаОкончания;
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Ссылка,"Договор","Объект");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры  

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Уведомление в Телеграм
	СообщениеТелеграмБоту = ПолучитьТекстСообщения();  
	Если ЗначениеЗаполнено(СообщениеТелеграмБоту) Тогда
		НовоеУведомление = Справочники.ВКМ_УведомлениеТелеграм.СоздатьЭлемент();   
		НовоеУведомление.Наименование = Ссылка;
		НовоеУведомление.ТекстСообщения = СообщениеТелеграмБоту; 
		НовоеУведомление.Записать();
	КонецЕсли;
	
Если ВремяНачалаПлан > ВремяОкончанияПлан Тогда
		Сообщить("Конец задачи не может быть раньше, чем ВремяНачалаПлан задачи.");
		Отказ = Истина;
	КонецЕсли; 
		
	Дата = НачалоДня(Дата); 
	
	Если Специалист.Пустая() Тогда
		Специалист = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;   
	
КонецПроцедуры  
	
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	Если ВремяНачалаПлан > ВремяОкончанияПлан Тогда
//		Сообщить("Конец задачи не может быть раньше, чем ВремяНачалаПлан задачи.");
//		Отказ = Истина;
//	КонецЕсли; 
//		
//	Дата = НачалоДня(Дата); 
//	
//	// Заполняем реквизит текущим значением параметра сеанса
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	Если Специалист.Пустая() Тогда
//		Специалист = ПараметрыСеанса.ТекущийПользователь;
//	КонецЕсли;   
//	
//КонецПроцедуры  
//}}MRG[ <-> ]
	  
#КонецОбласти 


#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекстСообщения()
	
	ТекстСообщения = "";
	
	Если ЭтоНовый() Тогда
		ТекстСообщения = "Поступила новая заявка на сервисное обслуживание";
	Иначе
		СтарыеЗначения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,"ДатаПроведенияРабот, ВремяНачалаПлан, ВремяОкончанияПлан, Специалист");
		
		ТекущиеЗначения = Новый Структура;
		ТекущиеЗначения.Вставить("ДатаПроведенияРабот", ДатаПроведенияРабот);
		ТекущиеЗначения.Вставить("ВремяНачалаПлан", ВремяНачалаПлан);
		ТекущиеЗначения.Вставить("ВремяОкончанияПлан", ВремяОкончанияПлан);
		ТекущиеЗначения.Вставить("Специалист", Специалист);
		
		Если Не ОбщегоНазначения.ДанныеСовпадают(СтарыеЗначения, ТекущиеЗначения) Тогда
			ТекстСообщения = "Изменена заявка на сервисное обслуживание";
		КонецЕсли;
	КонецЕсли;
	
	Если ТекстСообщения <> "" Тогда
		ТекстСообщения = СтрШаблон("%1
						|Номер заявки: №%2
						|Дата формирования: %3
						|Клиент: %4
						|Плановые сроки выполнения:
						|  - Дата: %5
						|  - Время: с %6 до %7
						|Ответственный специалист: %8",
						ТекстСообщения,
						Ссылка.Номер,
						Формат(Дата, "ДФ=dd.MM.yyyy"),
						Клиент,
						Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy"),
						Формат(ВремяНачалаПлан, "ДФ=ЧЧ:мм"),
						Формат(ВремяОкончанияПлан, "ДФ=ЧЧ:мм"),
						Специалист);		
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

#КонецОбласти  

#КонецЕсли

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ТаблицаПовторов.Очистить();
	ЕстьПовтор = Ложь;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
    // Удаляем помеченные документы
	Если ПометкаУдаления Тогда
		Движения.ВКМ_ЗаписиЗадач.Записать();
		Возврат;
	КонецЕсли;
	
	// регистр ЗаписиЗадач
	Движения.ВКМ_ЗаписиЗадач.Записывать = Истина;
	// Повторый отсуствуют
	Если НЕ ЕстьПовтор Тогда
		Движение = Движения.ВКМ_ЗаписиЗадач.Добавить();
		Движение.Период = Дата;
		Движение.ВремяНачала = ВремяНачалаПлан;
		Движение.ВремяОкончания = ВремяОкончанияПлан;
		Движение.Пользователь = Специалист;
	Иначе
		// ТЧ документа
		Для каждого ТекСтрока Из ТаблицаПовторов Цикл
			Если ТекСтрока.Удаленный Тогда
				// Пропуск строки
				Продолжить;
			КонецЕсли;
			
			Движение = Движения.ВКМ_ЗаписиЗадач.Добавить();	
			// Есть замещения
			Если ЗначениеЗаполнено(ТекСтрока.ДатаЗамещения) Тогда
				Движение.Период = ТекСтрока.ДатаЗамещения;
				Движение.ВремяНачала = ТекСтрока.ВремяНачалаЗамещения;
				Движение.ВремяОкончания = ТекСтрока.ВремяОкончанияЗамещения;
			// Замещений нет	
			Иначе
				Движение.Период = ТекСтрока.ДатаПовтора;
				Движение.ВремяНачала = ВремяНачалаПлан;
				Движение.ВремяОкончания = ВремяОкончанияПлан;
			КонецЕсли;
			Движение.Пользователь = Специалист;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры 