  #Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	  
#Область ОбработчикиСобытий   
Процедура ОбработкаПроведения(Отказ, Режим)
		  
		  ПроверитьДанныеДоговора(Отказ);
		  
		  Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
		  ВсегоЧасовКОплатеКлиенту = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
		  СтавкаЧасаПоДоговору = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор,"ВКМ_СтоимостьЧаса");
		  СуммаКОплатеКлиенту = ВсегоЧасовКОплатеКлиенту * СтавкаЧасаПоДоговору;
		  
		  Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		  Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		  Движение.Период = Дата;
		  Движение.КоличествоЧасов = ВсегоЧасовКОплатеКлиенту;
		  Движение.СуммаКОплате = СуммаКОплатеКлиенту;
		  Движение.Клиент = Клиент;
		  Движение.Договор = Договор;
		  
КонецПроцедуры    

Процедура ПроверитьДанныеДоговора(Отказ)
	
	Если ВыполненныеРаботы.Количество() = 0 Тогда
		ТекстСообщения = "Для проведения документа заполните табличную часть документа";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;  
		Возврат;
	КонецЕсли;   
	
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ВидДоговора, ВКМ_ДатаНачала, ВКМ_ДатаОкончания");
	
	Если РеквизитыДоговора.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда 
		ТекстСообщения = "Для проведения документа должен быть выбран договор с типом ""Абонентская плата""";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Ссылка,"Договор","Объект");
		Отказ = Истина; 
		Возврат;
	Иначе
		Если РеквизитыДоговора.ВКМ_ДатаНачала > Дата Или РеквизитыДоговора.ВКМ_ДатаОкончания < Дата Тогда
			ТекстСообщения = "Дата документа должна находиться в периоде действия договора: " 
                      + РеквизитыДоговора.BKM_ДатаНачала + " - " + РеквизитыДоговора.BKM_ДатаОкончания;
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Ссылка,"Договор","Объект");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
  
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		СообщениеТелеграмБоту = ПолучитьТекстСообщения();  
		Если ЗначениеЗаполнено(СообщениеТелеграмБоту) Тогда
			НовоеУведомление = Справочники.ВКМ_УведомлениеТелеграм.СоздатьЭлемент();   
			НовоеУведомление.Наименование = Ссылка;
			НовоеУведомление.ТекстСообщения = СообщениеТелеграмБоту; 
			НовоеУведомление.Записать();
		КонецЕсли;
КонецПроцедуры
	  
#КонецОбласти 


#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекстСообщения()
	
	ТекстСообщения = "";
	
	Если ЭтоНовый() Тогда
		ТекстСообщения = "Поступила новая заявка на сервисное обслуживание";
	Иначе
		СтарыеЗначения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,"ДатаПроведенияРабот, ВремяНачалаПлан, ВремяОкончанияПлан, Специалист");
		
		ТекущиеЗначения = Новый Структура;
		ТекущиеЗначения.Вставить("ДатаПроведенияРабот", ДатаПроведенияРабот);
		ТекущиеЗначения.Вставить("ВремяНачалаПлан", ВремяНачалаПлан);
		ТекущиеЗначения.Вставить("ВремяОкончанияПлан", ВремяОкончанияПлан);
		ТекущиеЗначения.Вставить("Специалист", Специалист);
		
		Если Не ОбщегоНазначения.ДанныеСовпадают(СтарыеЗначения, ТекущиеЗначения) Тогда
			ТекстСообщения = "Произошли изменения в заявке на обслуживание клиента";
		КонецЕсли;
	КонецЕсли;
	
	Если ТекстСообщения <> "" Тогда
		ТекстСообщения = СтрШаблон("%1
						|Номер заявки: №%2
						|Дата формирования: %3
						|Клиент: %4
						|Плановые сроки выполнения:
						|  - Дата: %5
						|  - Время: с %6 до %7
						|Ответственный специалист: %8",
						ТекстСообщения,
						Ссылка.Номер,
						Формат(Дата, "ДФ=dd.MM.yyyy"),
						Клиент,
						Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy"),
						Формат(ВремяНачалаПлан, "ДФ=ЧЧ:мм"),
						Формат(ВремяОкончанияПлан, "ДФ=ЧЧ:мм"),
						Специалист);		
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции
//	
//КонецФункции


#КонецОбласти  

#КонецЕсли
