
// Выделяем каждую категорию своим цветом при помощи условного оформления
Процедура НастройкаУсловногоОформленияПодЦветКатегорий(УсловноеОформлениеСписка, ИмяПоляДляОтбора, 
													   ИмяПоляДляОформления = Неопределено) Экспорт
		
	// Запросом получаем данные по названиям категорий и их цветам
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_КатегорииЗадач.Код КАК Код,
		|	ВКМ_КатегорииЗадач.Цвет КАК Цвет
		|ИЗ
		|	Справочник.ВКМ_КатегорииЗадач КАК ВКМ_КатегорииЗадач
		|ГДЕ
		|	ВКМ_КатегорииЗадач.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();                                                            
	Выборка = РезультатЗапроса.Выбрать();
	
	// Добавление элемента условного оформления по каждой категории
	Пока Выборка.Следующий() Цикл
		Элемент = УсловноеОформлениеСписка.Элементы.Добавить();

		// Выбираем группа или эмемент. В нашем случае нужен элемент
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		// Настраиваем сам отбор (поле "Код" должен быть равен значению "Код" из выборки результата запроса)
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоляДляОтбора);
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Выборка.Код;
		ОтборЭлемента.Использование = Истина;
		
		// Ставим цвет фона цветом категории
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Выборка.Цвет.Получить());
		
		Если ИмяПоляДляОформления <> Неопределено Тогда
			ПолеОформления = Элемент.Поля.Элементы.Добавить();
			ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(ИмяПоляДляОформления);
			ПолеОформления.Использование = Истина;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры 

Функция ПолучитьВремяНачалаРабочегоДня() Экспорт
	Возврат Константы.ВКМ_НачалоРабочегоДня.Получить();
КонецФункции