
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Очистить();
	НастройкаУсловногоОформленияПодЦветКатегорий();
	НастройкаОтбораПоПользователям();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеЦветаКатегории" Тогда
		НастройкаУсловногоОформленияПодЦветКатегорий(); 
	ИначеЕсли ИмяСобытия = "Изменить данные" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	Оповестить("Обновить данные планировщика");
КонецПроцедуры

&НаКлиенте
Процедура ВыделятьКатегорииЦветомПриИзменении(Элемент)
	НастройкаУсловногоОформленияПодЦветКатегорий();
КонецПроцедуры 

&НаСервере
Процедура НастройкаУсловногоОформленияПодЦветКатегорий()
	// Очищаем всё условное оформление, которое есть, чтобы не было дублей
	Список.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Очистить();
	Если ВыделятьКатегорииЦветом Тогда
		// Передаем условное оформление фиксированных настроек списка в процедуру общего модуля и там программно настраиваем
		УсловноеОформлениеСписка = Список.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление;
	    ВКМ_ОбщийСерверныйМодуль.НастройкаУсловногоОформленияПодЦветКатегорий(УсловноеОформлениеСписка, "Категория.Код", "Категория");
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ОтображатьЗадачиВсехПриИзменении(Элемент)
	НастройкаОтбораПоПользователям();
КонецПроцедуры 

&НаСервере
Процедура НастройкаОтбораПоПользователям()	
	Если НЕ ОтображатьЗадачиВсех Тогда
		ЭлементОтбора = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Пользователь");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ПараметрыСеанса.ТекущийПользователь;
		Элементы.Пользователь.Видимость = Ложь; 
	Иначе
		Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Очистить();
		Элементы.Пользователь.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

